Documents/НазначениеКурсовойРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>НазначениеКурсовойРаботы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗащиты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НагрузкаГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТемыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаПримере</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НазначениеКурсовойРаботы/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.НазначениеКурсовойРаботы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НазначениеКурсовойРаботы.Автор,
	|	НазначениеКурсовойРаботы.Группа,
	|	НазначениеКурсовойРаботы.Дата,
	|	НазначениеКурсовойРаботы.ДатаЗащиты,
	|	НазначениеКурсовойРаботы.Дисциплина,
	|	НазначениеКурсовойРаботы.Номер,
	|	НазначениеКурсовойРаботы.Руководитель,
	|	НазначениеКурсовойРаботы.Обучающиеся.(
	|		НомерСтроки,
	|		ФИО,
	|		Тема,
	|		НаПримере
	|	)
	|ИЗ
	|	Документ.НазначениеКурсовойРаботы КАК НазначениеКурсовойРаботы
	|ГДЕ
	|	НазначениеКурсовойРаботы.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОбучающиесяШапка = Макет.ПолучитьОбласть("ОбучающиесяШапка");
	ОбластьОбучающиеся = Макет.ПолучитьОбласть("Обучающиеся");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОбучающиесяШапка);
		ВыборкаОбучающиеся = Выборка.Обучающиеся.Выбрать();
		Пока ВыборкаОбучающиеся.Следующий() Цикл
			ОбластьОбучающиеся.Параметры.Заполнить(ВыборкаОбучающиеся);
			ТабДок.Вывести(ОбластьОбучающиеся, ВыборкаОбучающиеся.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
